of60/tutorials/rheoMultiRegionFoam/sphere/PTTLog/constant/sphere.back/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/sphere";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    energySource
    {
        type            scalarSemiImplicitSource;

        timeStart       0;
        duration        1e10;
        selectionMode   all;
        volumeMode      specific;

        injectionRateSuSp
        {
            T          (3 0);  
        }
    }
}

// ************************************************************************* //
