of60/tutorials/rheoMultiRegionFoam/sphere/PTTLog/constant/sphere.back/thermoProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type isotropic;

rhoCp              rhoCp    [1 -1 -2 -1 0 0 0] 500;  

kappaCoeffs
{
  a0 1.;
  a1 0.;
  a2 0.;
  a3 0.;
}

// ************************************************************************* //
