of60/tutorials/rheoMultiRegionFoam/sphere/PTTLog/0/fluid/tau
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }

   "(walls|map.fluid)"
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
     
    }
    
    "(front|back)"
    {
        type          wedge;
    }
}

// ************************************************************************* //
